

var jsonData = {
    "1001":"签到",
    "1002":"申请密钥",
    "1003":"申请卡表",
    "1004":"取款",
    "1005":"存款",
    "1006":"查询余额",
    "1007":"修改密码",
    "1008":"转账",
    "1009":"活期交易明细",
    "1011":"还款登记查询",
    "1012":"客户信息查询",
    "1013":"贷款还款登记",
    "1014":"取款冲正",
    "1016":"存款确认",
    "1017":"参数下载",
    "1040":"借记卡积分查询",
    "1041":"贷记卡积分查询",
    "1042":"活期转定期",
    "1046":"圈存",
    "1048":"圈提",
    "1050":"圈提确认",
    "1052":"圈存冲正",
    "1054":"脚本通知",
    "3001":"清机",
    "3008":"加钞"
};



function GetValue(key){

    var tranName = jsonData[key];

    if(tranName == undefined){
        tranName = key;
    }

    return tranName;
}
